package one2ten;

/**
 *                    _ooOoo_
 *                   o8888888o
 *                   88" . "88
 *                   (| -_- |)
 *                    O\ = /O
 *                ____/`---'\____
 *              .   ' \\| |// `.
 *               / \\||| : |||// \
 *             / _||||| -:- |||||- \
 *               | | \\\ - /// | |
 *             | \_| ''\---/'' | |
 *              \ .-\__ `-` ___/-. /
 *           ___`. .' /--.--\ `. . __
 *        ."" '< `.___\_<|>_/___.' >'"".
 *       | | : `- \`.;`\ _ /`;.`/ - ` : | |
 *         \ \ `-. \_ __\ /__ _/ .-` / /
 * ======`-.____`-.___\_____/___.-`____.-'======
 *                    `=---='
 * .............................................
 *          offer+1             大厂捞我
 * @Author: JerkYang
 * @CreateTime: 2019-09-11 13:34
 * @Description: 数组查找 44
 * 一个二维数组中（每个一维数组的长度相同），
 * 每一行都按照从左到右递增的顺序排序，每一列都按照从上到下递增的顺序排序。
 * 请完成一个函数，输入这样的一个二维数组和一个整数，判断数组中是否含有该整数。
 */
public class P_1 {
    public boolean Find(int target, int [][] array) {
        //行
        int rows = array.length;
        //列
        int cols = array[0].length;
        int i=0;int j=cols-1;
        while(j>=0 && i<rows){
            if(target<array[i][j]){
                j--;
            }else if (target>array[i][j]){
                i++;
            }else{
                return true;
            }

        }
        return false;
    }
}
